In [1]:
import pandas as pd
tripdata_path = '/home/vuthanhdatt/data-engineering-zoomcamp-2023/data/green_tripdata_2019-01.csv'
df_iter = pd.read_csv(tripdata_path, iterator=True, chunksize=100000)

In [2]:
from sqlalchemy import create_engine
engine = create_engine('postgresql://postgres:root@localhost:5432/ny_taxi')
engine.connect()

In [3]:
from time import time

df = next(df_iter)
df.columns = map(str.lower, df.columns)
df.lpep_pickup_datetime = pd.to_datetime(df.lpep_pickup_datetime)
df.lpep_dropoff_datetime = pd.to_datetime(df.lpep_dropoff_datetime)

df.head(n=0).to_sql(name='green_trip_data', con=engine, if_exists='replace')
df.to_sql(name='green_trip_data', con=engine, if_exists='append')

while True: 
    try:
        t_start = time()
        df = next(df_iter)
        df.columns = map(str.lower, df.columns)
        df.lpep_pickup_datetime = pd.to_datetime(df.lpep_pickup_datetime)
        df.lpep_dropoff_datetime = pd.to_datetime(df.lpep_dropoff_datetime)
        df.to_sql(name='green_trip_data', con=engine, if_exists='append')
        t_end = time()
        print('inserted another chunk, took %.3f second' % (t_end - t_start))

    except StopIteration:
        df.to_sql(name='green_trip_data', con=engine, if_exists='append')
        print("Finished ingesting data into the postgres database")
        break

inserted another chunk, took 10.309 second
inserted another chunk, took 10.203 second
inserted another chunk, took 10.193 second
inserted another chunk, took 10.216 second
inserted another chunk, took 10.395 second
inserted another chunk, took 3.275 second
Finished ingesting data into the postgres database

In [4]:
sql = """
SELECT count(*) from green_trip_data
"""
pd.read_sql(sql, con=engine)

    count
0  661836

In [5]:
pd.read_csv(tripdata_path).shape

(630918, 20)

In [6]:
zone_path = '/home/vuthanhdatt/data-engineering-zoomcamp-2023/data/taxi+_zone_lookup.csv'
df = pd.read_csv(zone_path)
df.columns = map(str.lower, df.columns)
df.to_sql(name='zones', con=engine, if_exists='replace')

265

In [7]:
sql = """
SELECT count(*) from zones
"""
pd.read_sql(sql, con=engine)

   count
0    265

In [8]:
pd.read_csv(zone_path).shape

(265, 4)

In [9]:
zone_path = '/home/vuthanhdatt/data-engineering-zoomcamp-2023/data/taxi+_zone_lookup.csv'
df = pd.read_csv(zone_path)
df.columns = map(str.lower, df.columns)
df

     locationid        borough                     zone service_zone
0             1            EWR           Newark Airport          EWR
1             2         Queens              Jamaica Bay    Boro Zone
2             3          Bronx  Allerton/Pelham Gardens    Boro Zone
3             4      Manhattan            Alphabet City  Yellow Zone
4             5  Staten Island            Arden Heights    Boro Zone
..          ...            ...                      ...          ...
260         261      Manhattan       World Trade Center  Yellow Zone
261         262      Manhattan           Yorkville East  Yellow Zone
262         263      Manhattan           Yorkville West  Yellow Zone
263         264        Unknown                       NV          NaN
264         265        Unknown                      NaN          NaN

[265 rows x 4 columns]